#include "Header.h"

vector<FuncDB> funcDB = {
	{0, task1},
	{1, task2},
	{2, task3},
	{3, task4},
	{4, SF}
};

vector<ItemDB> itemDB = {
	{ 0, -1, 0, "Меню"},
	{ 1, 0, -1, "ЗАДАНИЕ 1: Расчёт обоев"},
	{ 2, 1, -1, "ЗАДАНИЕ 2: Телефон в гостинице"},
	{ 3, 2, -1, "ЗАДАНИЕ 3: Массив \"Змейкой\""},
	{ 4, 3, -1, "ЗАДАНИЕ 4: Поиск цифры в строке"},
	{ 5, -1, 1, "item с подпунктами"},
	{ 6, 0, -1, "ЗАДАНИЕ 11: Расчёт обоев"},
	{ 7, 1, -1, "ЗАДАНИЕ 21: Телефон в гостинице"},
	{ 8, 2, -1, "ЗАДАНИЕ 31: Массив \"Змейкой\""},
	{ 9, 3, -1, "ЗАДАНИЕ 41: Поиск цифры в строке"},
	{ 10, -1, 2, "еще один item с подпунктами"},
	{ 11, 4, -1, "safe_input" }

};

vector<MenuDB> menuDB = {
	{ 0, {1,2,3,4,5,10,11}},
	{ 1, {6,7,8,9,10}},
	{ 2, {1,6,2,7}}
};
